---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTableIterator.Reset
source: html/e95a72ab-6d8c-0a0c-80bf-bd0acb8acb7e.htm
---
# Autodesk.Revit.DB.ExportPatternTableIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```